Phanxv/Microcontroller/STM32L152rb/Lab101/Lab102_TIMER/Project/src/main.c
#include "stm32l1xx.h"
#include "stm32l1xx_ll_system.h"
#include "stm32l1xx_ll_bus.h"
#include "stm32l1xx_ll_gpio.h"
#include "stm32l1xx_ll_pwr.h"
#include "stm32l1xx_ll_rcc.h"
#include "stm32l1xx_ll_utils.h"
#include "stm32l1xx_ll_exti.h"
#include "stm32l1xx_ll_tim.h"
#include "stdio.h"

void GPIO_Config();
void TIMBase_Config(void);//declare function TIMBase_Config
void SystemClock_Config(void);
int user_input;
int timecount = 2;

int main()
{
	GPIO_Config();
	TIMBase_Config();
	SystemClock_Config();
	while(1){
	user_input = LL_GPIO_IsInputPinSet(GPIOA,LL_GPIO_PIN_0);//user check
	if(user_input==1)
		{
			LL_TIM_EnableCounter(TIM2);//enablecounter TIM2
			LL_GPIO_SetOutputPin(GPIOB,LL_GPIO_PIN_6);//SET PIN6
			LL_GPIO_SetOutputPin(GPIOB,LL_GPIO_PIN_7);//SET PIN7		
		}
		if(timecount==1){
				LL_GPIO_ResetOutputPin(GPIOB,LL_GPIO_PIN_6);//SET PIN6
				LL_GPIO_ResetOutputPin(GPIOB,LL_GPIO_PIN_7);//SET PIN7
				++timecount;
				LL_TIM_DisableCounter(TIM2);//disablecounter TIM2
			}	
		
	};

}

void GPIO_Config()
{
	LL_GPIO_InitTypeDef GPIO_InitStruct;//call structure
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA);//Enable clock for GPIOA
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);//Enable clock for GPIOB
  
  GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;//Set mode to Input
  GPIO_InitStruct.Pin = LL_GPIO_PIN_0;//Set pin0 to Input
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;//set the pull-up/pull-down resistor configuration
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;//do not use PULL
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;//Set Speed to High
  LL_GPIO_Init(GPIOA,&GPIO_InitStruct);//set to GPIOA
  
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;//Set mode to Output
  GPIO_InitStruct.Pin = LL_GPIO_PIN_6;//Set pin6 to Output
  LL_GPIO_Init(GPIOB,&GPIO_InitStruct);//set to GPIOB
 
  GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;//Set mode to Output
  GPIO_InitStruct.Pin = LL_GPIO_PIN_7;//Set pin7 to Output
  LL_GPIO_Init(GPIOB,&GPIO_InitStruct);//set to GPIOB
	
};

void TIMBase_Config(void)//config function for Timer
{
	LL_TIM_InitTypeDef timbase_initstructure;//call Structure
	
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2);//Enable clock TIM2
	
	timbase_initstructure.ClockDivision = LL_TIM_CLOCKDIVISION_DIV1;//Specifies the clock division.
	timbase_initstructure.CounterMode = LL_TIM_COUNTERDIRECTION_UP;//counter up
	timbase_initstructure.Autoreload = 5000 - 1;//setup ARR
	timbase_initstructure.Prescaler = 6400 - 1;//setup PSC

	LL_TIM_Init(TIM2,&timbase_initstructure);//set to TIM2
	
	LL_TIM_EnableIT_UPDATE(TIM2);//enable interrupt
	
	NVIC_SetPriority(TIM2_IRQn,0);//set priority
	NVIC_EnableIRQ(TIM2_IRQn);//enable IRQ
	
	
}

void TIM2_IRQHandler(void) //interrupt function
{
	if(LL_TIM_IsActiveFlag_UPDATE(TIM2)==SET)//if check for flag == SET
		{
			--timecount;//countdown
			LL_TIM_ClearFlag_UPDATE(TIM2);//ClearFlag
			LL_TIM_SetCounter(TIM2,0);//Set to 0
		}
}


void SystemClock_Config(void)
{
  /* Enable ACC64 access and set FLASH latency */ 
  LL_FLASH_Enable64bitAccess();; 
  LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);

  /* Set Voltage scale1 as MCU will run at 32MHz */
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);
  LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
  
  /* Poll VOSF bit of in PWR_CSR. Wait until it is reset to 0 */
  while (LL_PWR_IsActiveFlag_VOSF() != 0)
  {
  };
  
  /* Enable HSI if not already activated*/
  if (LL_RCC_HSI_IsReady() == 0)
  {
    /* HSI configuration and activation */
    LL_RCC_HSI_Enable();
    while(LL_RCC_HSI_IsReady() != 1)
    {
    };
  }
  
	
  /* Main PLL configuration and activation */
  LL_RCC_PLL_ConfigDomain_SYS(LL_RCC_PLLSOURCE_HSI, LL_RCC_PLL_MUL_6, LL_RCC_PLL_DIV_3);

  LL_RCC_PLL_Enable();
  while(LL_RCC_PLL_IsReady() != 1)
  {
  };
  
  /* Sysclk activation on the main PLL */
  LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)
  {
  };
  
  /* Set APB1 & APB2 prescaler*/
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);
  LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_1);

  /* Set systick to 1ms in using frequency set to 32MHz                             */
  /* This frequency can be calculated through LL RCC macro                          */
  /* ex: __LL_RCC_CALC_PLLCLK_FREQ (HSI_VALUE, LL_RCC_PLL_MUL_6, LL_RCC_PLL_DIV_3); */
  LL_Init1msTick(32000000);
  
  /* Update CMSIS variable (which can be updated also through SystemCoreClockUpdate function) */
  LL_SetSystemCoreClock(32000000);
}